---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InvalidDataStreamException
source: html/265e8963-7ec9-8b23-ef99-8ddb549f2e54.htm
---
# InvalidDataStreamException Methods

Retrieves data needed to serialize the target object.